### Type of Triangle

Write a query identifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:

**Equilateral**: It's a triangle with  sides of equal length.
**Isosceles**: It's a triangle with  sides of equal length.
**Scalene**: It's a triangle with  sides of differing lengths.
**Not A Triangle**: The given values of **A**, **B**, and **C** don't form a triangle.

In [ ]:
SELECT 
  CASE
    WHEN A + B <= C OR B + C <= A OR C + A <= B THEN 'Not A Triangle'
    WHEN A = B AND B = C THEN 'Equilateral'
    WHEN A = B OR B = C OR A = C THEN 'Isosceles'
    ELSE 'Scalene'
  END AS Triangle_type
FROM TRIANGLES;

### The PADS

#### Generate the following two result sets:

Query an alphabetically ordered list of all names in OCCUPATIONS, immediately followed by the first letter of each profession as a parenthetical (i.e.: enclosed in parentheses). For example: **AnActorName(A)**, **ADoctorName(D)**, **AProfessorName(P)**, and **ASingerName(S)**.
Query the number of ocurrences of each occupation in OCCUPATIONS. Sort the occurrences in ascending order, and output them in the following format:

In [ ]:
SELECT CONCAT(Name,'(',LEFT(OCCUPATION,1),')') AS NAME_OCC FROM OCCUPATIONS ORDER BY Name ASC; SELECT CONCAT('There are a total of',' ',COUNT(OCCUPATION),' ',LOWER(OCCUPATION),'s.') FROM OCCUPATIONS GROUP BY OCCUPATION ORDER BY COUNT(OCCUPATION),OCCUPATION ;

### Occupations

You are given a table, BST, containing two columns: N and P, where N represents the value of a node in Binary Tree, and P is the parent of N.

In [ ]:
SELECT CASE
    WHEN P IS NULL THEN CONCAT(N, ' Root')
    WHEN N IN (SELECT DISTINCT P FROM BST) THEN CONCAT(N, ' Inner')
    ELSE CONCAT(N, ' Leaf')
    END
FROM BST
ORDER BY N ASC;